Bunkering_13/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 3.0187e-13; // background I=1%, U=0.01 m/s, L=1m (turbulence_initial_conditions.py)

boundaryField
{
    right               { type inletOutlet; inletValue $internalField; value $internalField; }
    left                { type inletOutlet; inletValue $internalField; value $internalField; }
    front               { type inletOutlet; inletValue $internalField; value $internalField; }
    back                { type inletOutlet; inletValue $internalField; value $internalField; }
    top                 { type inletOutlet; inletValue $internalField; value $internalField; }
    bottom              { type epsilonWallFunction; value $internalField; }
    bunkering-boat_m    { type epsilonWallFunction; value $internalField; }
    bunkering-quay_m    { type epsilonWallFunction; value $internalField; }
    nozzle_holder_wall  { type epsilonWallFunction; value $internalField; }
    nozzle              { type turbulentMixingLengthDissipationRateInlet; mixingLength 6.846e-2; value uniform 2.8220e5; } // l = 0.07*D, D=978mm (100% rupture nozzle). eps0 = Cmu^0.75 k^1.5 / l with k=2400 (I=0.05, U=800). Self-scaling BC -- recomputed from instantaneous U at runtime.
}
// ************************************************************************* //
