Bunkering_13/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
//create nozzle
    {
        name    nozzle;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "bunkering-nozzle_xneg_m";
            }
    }
    {
        name    nozzle;
        type    faceSet;
        action  subset;
        source  boxToFace;
        // 978mm square nozzle, rotated to fire -x
        // (bunkering_nozzle_xneg_978mm_m.stl): recessed exit cap is now a
        // vertical face at x=0.978m (housing spans x=0-2.5, exit hole
        // y in +/-0.489, z in 6.511-7.489). Thin box in x around x=0.978.
        box (0.9765 -0.489 6.511)(0.9795 0.489 7.489);
    }
//create nozzle_holder_wall
    {
        name    nozzle_holder_wall;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
            {
                patch "bunkering-nozzle_xneg_m";
            }
    }
    {
        name    nozzle_holder_wall;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     nozzle;
    }
);


// ************************************************************************* //
